{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 100, 100, 1], "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": "float32", "filters": 32, "name": "conv2d_1", "activation": "linear", "kernel_size": [3, 3], "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_1", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_2", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_2", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_3", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_3", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_4", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_4", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.7}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "filters": 128, "name": "conv2d_5", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_5", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.7}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [4, 4], "filters": 128, "name": "conv2d_6", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_6", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.7}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [5, 5], "filters": 2048, "name": "conv2d_7", "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_7", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.7}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 2048, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_8", "beta_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.7}}, {"class_name": "Dense", "config": {"units": 2, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "activation": "softmax", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "bias_constraint": null}}]}